---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.HatchBackgroundColor
source: html/47e158cd-a84e-13c2-8459-e0b0c95cc6f7.htm
---
# Autodesk.Revit.DB.ACADExportOptions.HatchBackgroundColor Property

The color that will be set as hatch backgound color on the exported hatch.
 This color will be used only if useHatchBackgroundColor is true.
 default value is white

## Syntax (C#)
```csharp
public Color HatchBackgroundColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null